class words:
    all = "🕘 : Получено {words} сообщений{dots}"
    except_all = "🕘 : Продолжаю сканировать, получено {} сообщений.."
    out = "✅ : Самые популярные сообщения чата:\n"


class ping:
    form = "🌐 : **Понг!**\nОтветил ~"
    min = "быстрее скорости света! 🚑"


class read:
    on = "✅ : Теперь все сообщения в чате читаются сами!"
    off = "❌ : Не читаю больше этот чат!"


class voice:
    block = "✅ : Теперь голосовые будут блокироваться!"
    unblock = "❌ : Больше не блокирую голосовые"
    default_message = "__Пользователь заблокировал голосовые сообщения.__"


class farm:
    off = "❌ : Ферма отключена!"
    on = "✅ : Ферма включена!"
    already_on = "❌ : Ферма уже запущена!"
    off_notask = "❌ : Ферма отключена, но таск уже был остановлен."


class ai:
    token_set = "✅ : Токен установлен!"
    no_token = (
        "🚫 : **[Токен](https://aistudio.google.com/api-keys)** не установлен."
    )


no_text = "🚫 : Текст не найден!"
error = "🪲 : Непредвиденная ошибка: {}"
